# Projeto de Bases de Dados - Parte 2

### Docente Responsável

Prof. Flávio Martins

### Grupo 54
<dl>
    <dt>5H horas (33.3%)</dt>
    <dd>ist92429 Bárbara Martins</dd>
    <dt>5H horas (33.3%)</dt>
    <dd>ist99214 Ema Estima</dd>
    <dt>5H horas (33.3%)</dt>
    <dd>ist89467 Jenisha Lalgi</dd>
<dl>

# Empresa de comércio online

## 1 Conversão E-A para Modelo Relacional

Recorde a notação para o Modelo Relacional exposta nas aulas teóricas como se segue:

- relacaoA (<u>atributo1</u>, … , atributoN)
    - atributoX, … , atributoZ: FK (RelacaoDestino)
    - unique(atributoA, … , AtributoC)
- relacaoB (<u>atributo1</u>, … , atributoN)
    - atributoX, … , atributoZ: FK (RelacaoDestino)
    - unique(atributoA, … , AtributoC)

1. As relações são expressas por um nome seguido dos atributos entre parêntesis;
    - As chave primárias são expressas sublinhando os atributos que a compõem;
    - As chaves estrangeiras para outras relações são expressas através da lista de atributos que a compõem, seguida de “: FK(RelacaoDestino)”. A ordem dos atributos que compõem a FK deve corresponder à ordem dos atributos da chave na relação destino;
    - As chaves candidatas são expressas através da expressão “unique”, seguida da lista de atributos que a compõem entre parêntesis;
    - As restrições de integridade ao Modelo Relacional são descritas em termos dos conceitos deste modelo.

### 1.1 Modelo Relacional com Restrições de Integridade

1. Desenvolva um Modelo Relacional correspondente ao modelo Entidade-Associação;
2. Complemente a seu Modelo Relacional com um conjunto de Restrições de Integridade que represente o modelo E-A apresentado com a maior fidelidade.

- relacaoA (<u>atributo1</u>, … , atributoN)
    - atributoX, … , atributoZ: FK (RelacaoDestino)
    - unique(atributoA, … , AtributoC)
- relacaoB (<u>atributo1</u>, … , atributoN)
    - atributoX, … , atributoZ: FK (RelacaoDestino)
    - unique(atributoA, … , AtributoC)
- relacaoC (<u>atributo1</u>, … , atributoN)
    - atributoX, … , atributoZ: FK (RelacaoDestino)
    - unique(atributoA, … , AtributoC)
- relacaoD (<u>atributo1</u>, … , atributoN)
    - atributoX, … , atributoZ: FK (RelacaoDestino)
    - unique(atributoA, … , AtributoC)
- relacaoE (<u>atributo1</u>, … , atributoN)
    - atributoX, … , atributoZ: FK (RelacaoDestino)
    - unique(atributoA, … , AtributoC)

### 1.2 Restrições de Integridade não passíveis de conversão

Identifique todas as Restrições de Integridade do modelo Entidade-Associação apresentado que não são passíveis de conversão para o modelo relacional.

## Conversão do E-A para Modelo Relacional 

- Department(<u>name</u>)
- Workplace(<u>address</u>, lat, long)
    - UNIQUE(lat,long)
    - IC-1: address must exist in office and/or warehouse
- Office(<u>address</u>)
    - address: FK(Workplace)
- Warehouse(<u>address</u>)
    - address: FK(Workplace)
- Employee(<u>SSN</u>, TIN, bdate, name)
    - UNIQUE(TIN)
    - IC-2: every employee has to participate in works
- Product(<u>SKU</u>, name, price, description, EAN)
    - IC-3:every product has to participate in supply-contract
- Supplier(<u>TIN</u>, name, address)
    - IC-4: every supplier has to particiate once in supply-contract
- Supply-contract(<u>TIN</u>, SKU, date)
- Customer(<u>cust_no</u>, name, email, phone, address)
    - UNIQUE(email)
- Order(<u>order_no</u>, date, cust_no, payed)
    - cust_no: FK(Customer) NOT NULL
    - IC-5: payed is 'yes'/'no'
    - IC-6: every order has to participate n contains
- Contains(<u>order_no</u>, <u>SKU</u>, qty)
    - order_no: FK(Order)
    - SKU: FK(Product)
- Works(<u>SSN</u>, <u>address</u>, name)
    - SSN: FK(Employee)
    - address: FK(Workplace)
    - name: FK(Deparment) NOT NULL
- Delivery(<u>TIN</u>, <u>address</u>)
    - TIN: FK(Supply-contract)
    - address: FK(Warehouse)
- Process(<u>SSN</u>, <u>order_no</u>)
    - SSN: FK(Employee)
    - order_no: FK(Order)

## 2 Algebra Relacional

Recorde a notação exposta nas aulas teóricas como se segue:

$\Pi_{atributo1} \big( \sigma_{atributo1=atributo2} (relacaoA \bowtie relacaoB) \big)$

#### Simbolos
- $\cup$ union 			
- $\cap$ intersection 		
- $-$ difference 		
- $\times$ cartesian product 
- $\div$ division 			
- $\rho$ rename 			
- $\bowtie$ natural join 		
- $\wedge$ Logical AND 	
- $\vee$ Logical OR 	
- $\neg$ Logical NOT 	

Considerando o modelo relacional desenvolvido, apresente as expressões algébricas correspondentes a cada uma das seguintes interrogações:

1. Liste o nome de todos os clientes que fizeram encomendas contendo produtos de preço superior a €50 no ano de 2023;

$\Pi_{customer.name} \big( \sigma_{price>50 \wedge date>'31-12-2022' \wedge date<'01-01-2024'} (product \bowtie contains \bowtie order \bowtie customer) \big)$

2. Liste o nome de todos os empregados que trabalham em armazéns e não em escritórios e processaram encomendas em Janeiro de 2023;

$\Pi_{name}\big ((\Pi_{SSN}\big( \sigma_{date<'01-02-2023' \wedge date>'31-12-2022'} (order \bowtie process) \big) - \Pi_{SSN} \big(office \bowtie works))\bowtie employee)$

3. Indique o nome do produto mais vendido;

$R ←\big(_{SKU}G_{sum(qty)→c}contains \big)$

$\Pi_{name} \big((G_{max(c)}(R)) \bowtie product)$

4. Indique o valor total de cada venda realizada.

$R←\big(_{order\_no}G_{sum(qty*price)→c} (contains \bowtie product))$

$\Pi_{order\_no, c} \big(\sigma_{payed='yes'}(order \bowtie R)\big)$

## 3 Tradução do Modelo Relacional para SQL

### 3.1 Esquema Relacional (schema.sql)

Crie uma base de dados SQL correspondente ao esquema Relacional desenvolvido no ponto anterior.
Utilizando a linguagem SQL (DDL), apresente as instruções para criar o esquema de bases de dados correspondente ao modelo relacional desenvolvido. Deve certificar-se de que os tipos de dados e tamanhos de campo selecionados sejam os mais apropriados. As restrições aplicáveis a cada campo, linha e tabela também devem ser especificadas recorrendo às instruções NOT NULL, CHECK, PRIMARY KEY, UNIQUE e FOREIGN KEY conforme seja apropriado.


Nota: Apresente todas as restrições existentes no modelo Relacional que não podem ser capturadas (implementadas) no esquema SQL, escrevendo-as como comentários na tabela respectiva.

In [1]:
%reload_ext sql
%sql postgresql://db:db@postgres/db

There's a new jupysql version available (0.7.5), you're running 0.7.4. To upgrade: pip install jupysql --upgrade

In [3]:
%%sql
-- schema.sql

-- DROP TABLE ...

DROP TABLE IF EXISTS department CASCADE;
DROP TABLE IF EXISTS employee CASCADE;
DROP TABLE IF EXISTS workplace CASCADE;
DROP TABLE IF EXISTS works CASCADE;
DROP TABLE IF EXISTS _order CASCADE;
DROP TABLE IF EXISTS customer CASCADE;
DROP TABLE IF EXISTS process CASCADE;
DROP TABLE IF EXISTS product CASCADE;
DROP TABLE IF EXISTS contains CASCADE;
DROP TABLE IF EXISTS supplier CASCADE;
DROP TABLE IF EXISTS supply_contract CASCADE;
DROP TABLE IF EXISTS warehouse CASCADE;
DROP TABLE IF EXISTS delivery CASCADE;
DROP TABLE IF EXISTS office CASCADE;

-- CREATE TABLE 


CREATE TABLE department (
    name VARCHAR(50) NOT NULL,
    PRIMARY KEY(name)
);

--IC2: every employee has to participate in works
CREATE TABLE employee (
    ssn numeric(12,0) NOT NULL, 
    TIN numeric(9,0) NOT NULL, 
    bdate DATE NOT NULL, 
    name VARCHAR(80) NOT NULL,
    PRIMARY KEY(ssn),
    UNIQUE(TIN)
);

--IC1: address must exist in office and/or warehouse
CREATE TABLE workplace (
    address VARCHAR(100) NOT NULL, 
    lat DECIMAL(9,6) NOT NULL,
    longi DECIMAL(9,6) NOT NULL,
    PRIMARY KEY(address),
    UNIQUE(lat, longi)
);

CREATE TABLE warehouse (
    address VARCHAR(100) NOT NULL,
    PRIMARY KEY(address),
    FOREIGN KEY(address) REFERENCES workplace(address)
);

CREATE TABLE office (
    address VARCHAR(100) NOT NULL,
    PRIMARY KEY(address),
    FOREIGN KEY(address) REFERENCES workplace(address)
);

--IC2: every employee has to participate in works
CREATE TABLE works (
    employee numeric(12,0) NOT NULL, 
    address VARCHAR(100) NOT NULL,
    department_name VARCHAR(50) NOT NULL,
    PRIMARY KEY(employee, address),
    FOREIGN KEY(employee) REFERENCES employee(ssn),
    FOREIGN KEY(address) REFERENCES workplace(address),
    FOREIGN KEY(department_name) REFERENCES department(name)
);

CREATE TABLE customer (
    cust_no SERIAL NOT NULL, 
    name VARCHAR(80) NOT NULL,
    email VARCHAR(80) NOT NULL, 
    phone numeric(15,0) NOT NULL, 
    address VARCHAR(300) NOT NULL,
    PRIMARY KEY(cust_no),
    UNIQUE(email)
);

--IC3: every product has to participate in supply-contract
CREATE TABLE product (
    sku VARCHAR(12) NOT NULL, 
    name VARCHAR(80) NOT NULL, 
    description TEXT NOT NULL, 
    price DECIMAL(10,2) NOT NULL,
    ean numeric(13, 0),
    PRIMARY KEY(sku),
    CHECK(price>0)
);
           
--IC5: every order has to participate in contains     
CREATE TABLE _order (
    order_no SERIAL NOT NULL, 
    date TIMESTAMP NOT NULL,
    cust_no INT NOT NULL,
    payed VARCHAR(3) DEFAULT 'no' ,
    PRIMARY KEY(order_no),
    FOREIGN KEY(cust_no) REFERENCES customer(cust_no),
    CHECK(payed='yes' OR payed='no')
);

CREATE TABLE process (
    employee numeric(12,0) NOT NULL, 
    order_no INT NOT NULL,
    PRIMARY KEY(employee,order_no),
    FOREIGN KEY(employee) REFERENCES employee(ssn),
    FOREIGN KEY(order_no) REFERENCES _order(order_no)
);

--IC5: every order has to participate in contains
CREATE TABLE contains (
    order_no INT NOT NULL, 
    sku VARCHAR(12) NOT NULL, 
    qty INT NOT NULL,
    PRIMARY KEY(order_no, sku),
    FOREIGN KEY(order_no) REFERENCES _order(order_no),
    FOREIGN KEY(sku) REFERENCES product(sku),
    CHECK(qty>0)
);

--IC4: every suplier has to participate once in supply-contract 
CREATE TABLE supplier (
    TIN numeric(9,0) NOT NULL, 
    name VARCHAR(80) NOT NULL, 
    address VARCHAR(100) NOT NULL,
    PRIMARY KEY(TIN)
);

--IC3: every product has to participate in supply-contract
--IC4: every suplier has to participate once in supply-contract 
CREATE TABLE supply_contract (
    TIN numeric(9,0) NOT NULL, 
    sku VARCHAR(12) NOT NULL, 
    date TIMESTAMP NOT NULL,
    PRIMARY KEY(TIN),
    FOREIGN KEY(TIN) REFERENCES supplier(TIN),
    FOREIGN KEY(sku) REFERENCES product(sku)
);

CREATE TABLE delivery (
    supplier numeric(10,0) NOT NULL, 
    address VARCHAR(100) NOT NULL,
    PRIMARY KEY(supplier, address),
    FOREIGN KEY(supplier) REFERENCES supplier(TIN),
    FOREIGN KEY(address) REFERENCES workplace(address)
);

*  postgresql://db:***@postgres/db
Done.
Done.
Done.
Done.
Done.
Done.
Done.
Done.
Done.
Done.
Done.
Done.
Done.
Done.
Done.
Done.
Done.
Done.
Done.
Done.
Done.
Done.
Done.
Done.
Done.
Done.
Done.
Done.

[]

### 3.2 Carregamento da Base de Dados

Crie um script SQL (DML) com todas as instruções INSERT necessárias para criar alguns dados de teste sintéticos para facilitar a validação dos resultados esperados das consultas (lembre-se de que cada tabela deve conter pelo menos uma linha e que todas as consulta têm de retornar um resultado não vazio).

In [4]:
%%sql
-- populate.sql

INSERT INTO department VALUES ('Producao');
INSERT INTO department VALUES ('Marketing');
INSERT INTO department VALUES ('Contabilidade');
INSERT INTO department VALUES ('Recursos Humanos');

INSERT INTO employee VALUES (123456789001, 567890012, '1993-05-23', 'Joaquim Carlos');
INSERT INTO employee VALUES (123456789002, 567890013, '1994-11-03', 'Catarina Alves');
INSERT INTO employee VALUES (123456789003, 567890014, '1990-02-17', 'Beatriz Maria');
INSERT INTO employee VALUES (123456789004, 567890015, '1989-12-28', 'Pedro Maxi');
INSERT INTO employee VALUES (123456789005, 567890016, '1997-07-09', 'Jorge Filipa');

INSERT INTO workplace VALUES ('Rua Americo, n12, 1865-002, PORTUGAL', 38.707008, 9.097605);
INSERT INTO workplace VALUES ('Rua Almirante Reis, n9, 1000-001, PORTUGAL', 35.900008, 3.097898);
INSERT INTO workplace VALUES ('Rua Enfante Madalena, n5, 1000-064, PORTUGAL', 39.494508, -12.098745);
INSERT INTO workplace VALUES ('Rua da Bela, n4, 1000-181, PORTUGAL', 30.109500, 10.437645);
INSERT INTO workplace VALUES ('Rua Professor, n20, 1865-091, PORTUGAL', -35.123500, 10.498765);
INSERT INTO workplace VALUES ('Rua Adormecida, n4, 1000-003, PORTUGAL', 34.897598, 12.222345);

INSERT INTO warehouse VALUES ('Rua Americo, n12, 1865-002, PORTUGAL');
INSERT INTO warehouse VALUES ('Rua da Bela, n4, 1000-181, PORTUGAL');
INSERT INTO warehouse VALUES ('Rua Adormecida, n4, 1000-003, PORTUGAL');

INSERT INTO office VALUES ('Rua Almirante Reis, n9, 1000-001, PORTUGAL');
INSERT INTO office VALUES ('Rua Enfante Madalena, n5, 1000-064, PORTUGAL');
INSERT INTO office VALUES ('Rua Professor, n20, 1865-091, PORTUGAL');

INSERT INTO works VALUES (123456789001, 'Rua Almirante Reis, n9, 1000-001, PORTUGAL', 'Contabilidade');
INSERT INTO works VALUES (123456789002, 'Rua Americo, n12, 1865-002, PORTUGAL', 'Producao');
INSERT INTO works VALUES (123456789003, 'Rua Professor, n20, 1865-091, PORTUGAL', 'Recursos Humanos');
INSERT INTO works VALUES (123456789004, 'Rua da Bela, n4, 1000-181, PORTUGAL', 'Producao');
INSERT INTO works VALUES (123456789005, 'Rua Adormecida, n4, 1000-003, PORTUGAL', 'Marketing');

INSERT INTO customer (name, email, phone, address) 
    VALUES ('Maria Alberta', 'mariaalberta@gmail.com', 960897654, 'Rua 24 de Julho, n 15, 2800-012, PORTUGAL');
INSERT INTO customer (name, email, phone, address) 
    VALUES ('Rodrigo Gomes', 'rodogmes@gmail.com', 963897555, 'Rua D. Afonso, n 9, 1000-121, PORTUGAL');
INSERT INTO customer (name, email, phone, address) 
    VALUES ('Guilherme Reis', 'guilhermereis@gmail.com', 960123645, 'Avenida Florescente, n 22, 1000-221, PORTUGAL');
INSERT INTO customer (name, email, phone, address) 
    VALUES ('Maria Miguel', 'mariamiguel@gmail.com', 960123456, 'Rua Brinquedos, n 54, 2800-043, PORTUGAL');
INSERT INTO customer (name, email, phone, address) 
    VALUES ('Bruna Xavier', 'bruna_xavier@gmail.com', 960987654, 'Rua Social, n 35, 1000-303, PORTUGAL');
INSERT INTO customer (name, email, phone, address)  
    VALUES ('Bruno Mendes', 'bruno_mendes12@gmail.com', 960654378, 'Rua da Quinta das Abelhas, n 12, 1000-400, PORTUGAL');
INSERT INTO customer (name, email, phone, address)  
    VALUES ('Leonor Reis', 'leonor_r_02@gmail.com', 960238746, 'Avenida Berna, n 2, 1000-010, PORTUGAL');

INSERT INTO product VALUES ('11abs298711k', 'Luvas', 'Luvas grossas para usar no inverno', 10.99);
INSERT INTO product VALUES ('11abs2235613', 'Caneca', 'Caneca com signo de escorpiao', 57.22, 2000033330120);
INSERT INTO product VALUES ('res465dgd512', 'Beleza', 'Creme alo vera para cara', 7.59);
INSERT INTO product VALUES ('a123gbb00512', 'Saco Quente', 'Saco de agua quente vermelho', 70.12, 2222033330401);
INSERT INTO product VALUES ('t002op900534', 'Creme', 'Creme para o corpo de coco marca dove', 30.29);
INSERT INTO product VALUES ('sd345g987op0', 'Pulseira', 'Pulseira branca', 67.77, 2222033330601);
INSERT INTO product VALUES ('sd342fg67op0', 'Canetas', 'Canetas coloridas', 45.89, 2222000330701);
INSERT INTO product VALUES ('234dft876ft5', 'Casaco', 'Casaco preto ZARA', 90.10, 2222000033801);
INSERT INTO product VALUES ('123sdvf765gt', 'Perfume', 'Perfume zara', 65.78, 2222003330901);
INSERT INTO product VALUES ('123sdvf766yt', 'Brincos', 'Brincos longos pratiados', 50.99, 2200033331001);
INSERT INTO product VALUES ('900sdvf766yt', 'Colar', 'Colar de coracao pratiado', 78.65);


INSERT INTO _order (date, cust_no, payed) 
    VALUES ('2022-07-12', 1, 'yes');
INSERT INTO _order (date, cust_no, payed) 
    VALUES ('2022-11-19', 2, 'yes');
INSERT INTO _order (date, cust_no) 
    VALUES ('2022-12-30', 3);
INSERT INTO _order (date, cust_no, payed) 
    VALUES ('2023-01-06', 6, 'yes');
INSERT INTO _order (date, cust_no, payed) 
    VALUES ('2023-01-12', 4, 'yes');
INSERT INTO _order (date, cust_no) 
    VALUES ('2023-01-12', 4);
INSERT INTO _order (date, cust_no, payed) 
    VALUES ('2023-01-20', 5, 'no');
INSERT INTO _order (date, cust_no, payed) 
    VALUES ('2023-01-23', 6, 'yes');
INSERT INTO _order (date, cust_no) 
    VALUES ('2023-01-24', 1);
INSERT INTO _order (date, cust_no, payed) 
    VALUES ('2023-02-28', 7, 'yes');
INSERT INTO _order (date, cust_no, payed) 
    VALUES ('2023-02-28', 7, 'yes');
INSERT INTO _order (date, cust_no, payed) 
    VALUES ('2023-05-04', 3, 'yes');
INSERT INTO _order (date, cust_no, payed) 
    VALUES ('2023-06-17', 3, 'yes');

INSERT INTO process VALUES (123456789001,1);
INSERT INTO process VALUES (123456789001,2);
INSERT INTO process VALUES (123456789001,3);
INSERT INTO process VALUES (123456789002,4);
INSERT INTO process VALUES (123456789002,5);
INSERT INTO process VALUES (123456789002,6);
INSERT INTO process VALUES (123456789002,7);
INSERT INTO process VALUES (123456789003,8);
INSERT INTO process VALUES (123456789003,9);
INSERT INTO process VALUES (123456789004,10);
INSERT INTO process VALUES (123456789004,11);
INSERT INTO process VALUES (123456789004,12);
INSERT INTO process VALUES (123456789005,13);

INSERT INTO contains VALUES (1, '11abs298711k', 4);
INSERT INTO contains VALUES (2, '11abs2235613', 1);
INSERT INTO contains VALUES (3, 'res465dgd512', 10);
INSERT INTO contains VALUES (4, 'a123gbb00512', 2);
INSERT INTO contains VALUES (5, 't002op900534', 3);
INSERT INTO contains VALUES (6, 'sd342fg67op0', 3);
INSERT INTO contains VALUES (7, '234dft876ft5', 2);
INSERT INTO contains VALUES (8, '123sdvf765gt', 1);
INSERT INTO contains VALUES (9, 'sd342fg67op0', 2);
INSERT INTO contains VALUES (10, '900sdvf766yt', 2);
INSERT INTO contains VALUES (11, '11abs2235613', 2);
INSERT INTO contains VALUES (12, 'sd345g987op0', 5);
INSERT INTO contains VALUES (13, '11abs298711k', 10);
INSERT INTO contains VALUES (13, '123sdvf766yt', 2);

INSERT INTO supplier VALUES (999000101, 'Mario Francisco', 'Rua da Maria Fernandes, n 9, 1 esq, 2620-182, PORTUGAL');
INSERT INTO supplier VALUES (999000202, 'Jose Almeida', 'Rua Oasis, n 12, 2 drt, 1865-009, PORTUGAL');
INSERT INTO supplier VALUES (999000303, 'Pedro Maria', 'Rua Arco-iris, n 5, 8 esq, 1000-263, PORTUGAL');
INSERT INTO supplier VALUES (999000404, 'Alberto Francisco', 'Rua verde, n 34, 6 drt, 1000-801, PORTUGAL');
INSERT INTO supplier VALUES (999000505, 'Beatriz Alves', 'Rua nemo, n 30, 1500-901, PORTUGAL');
INSERT INTO supplier VALUES (999000606, 'Alvaro Pica', 'Rua Palhaço, n 3, 5 esq, 1675-101, PORTUGAL');
INSERT INTO supplier VALUES (999000707, 'Raquel Dias', 'Rua D. Dinis, n 1, 1 esq, 1600-100, PORTUGAL');
INSERT INTO supplier VALUES (999000808, 'Marcia Marques', 'Rua Viva, n 4, 2115-001, PORTUGAL');
INSERT INTO supplier VALUES (999000909, 'Linda Murta', 'Rua dsa Verdades, n 44, 2710-201, PORTUGAL');
INSERT INTO supplier VALUES (999001009, 'Sima Silva', 'Rua Amerela, n 22, 2635-003, PORTUGAL');
INSERT INTO supplier VALUES (999002309, 'Ricardo Silva', 'Rua Alvaro de Campos, n 5, 2645-112, PORTUGAL');

INSERT INTO supply_contract VALUES (999000101, '11abs298711k', '2021-06-12');
INSERT INTO supply_contract VALUES (999000202, '11abs2235613', '2021-06-23');
INSERT INTO supply_contract VALUES (999000303, 'res465dgd512', '2021-08-02');
INSERT INTO supply_contract VALUES (999000404, 'a123gbb00512', '2021-10-07');
INSERT INTO supply_contract VALUES (999000505, 't002op900534', '2021-10-27');
INSERT INTO supply_contract VALUES (999000606, 'sd345g987op0', '2021-11-12');
INSERT INTO supply_contract VALUES (999000707, '234dft876ft5', '2021-11-15');
INSERT INTO supply_contract VALUES (999000808, '123sdvf765gt', '2021-12-12');
INSERT INTO supply_contract VALUES (999000909, '123sdvf766yt', '2022-01-01');
INSERT INTO supply_contract VALUES (999001009, '900sdvf766yt', '2022-01-01');
INSERT INTO supply_contract VALUES (999002309, 'sd342fg67op0', '2022-12-12');

INSERT INTO delivery VALUES (999000101, 'Rua Americo, n12, 1865-002, PORTUGAL');
INSERT INTO delivery VALUES (999000202, 'Rua da Bela, n4, 1000-181, PORTUGAL');
INSERT INTO delivery VALUES (999000303, 'Rua da Bela, n4, 1000-181, PORTUGAL');
INSERT INTO delivery VALUES (999000404, 'Rua Americo, n12, 1865-002, PORTUGAL');
INSERT INTO delivery VALUES (999000505, 'Rua Adormecida, n4, 1000-003, PORTUGAL');
INSERT INTO delivery VALUES (999000606, 'Rua Adormecida, n4, 1000-003, PORTUGAL');
INSERT INTO delivery VALUES (999000707, 'Rua Adormecida, n4, 1000-003, PORTUGAL');
INSERT INTO delivery VALUES (999000808, 'Rua Americo, n12, 1865-002, PORTUGAL');
INSERT INTO delivery VALUES (999000909, 'Rua Adormecida, n4, 1000-003, PORTUGAL');
INSERT INTO delivery VALUES (999001009, 'Rua da Bela, n4, 1000-181, PORTUGAL');
INSERT INTO delivery VALUES (999002309, 'Rua Americo, n12, 1865-002, PORTUGAL');

*  postgresql://db:***@postgres/db
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.

[]

## 4 Linguagem SQL

Apresente a expressão SQL correspondente  a cada uma das interrogações de Álgebra Relacional.

1. Liste o nome de todos os clientes que fizeram encomendas contendo produtos de preço superior a €50 no ano de 2023;

In [13]:
%%sql

-- SELECT ...
SELECT DISTINCT  
    customer.name
FROM 
    product JOIN contains USING (sku)
    JOIN _order USING (order_no)  
    JOIN customer USING (cust_no)
WHERE 
    price>50 AND EXTRACT(YEAR FROM date)=2023;

*  postgresql://db:***@postgres/db
4 rows affected.

[('Bruna Xavier',), ('Bruno Mendes',), ('Guilherme Reis',), ('Leonor Reis',)]

2. Liste o nome de todos os empregados que trabalham em armazéns e não em escritórios e processaram encomendas em Janeiro de 2023;

In [12]:
%%sql

-- SELECT ...
SELECT employee.name FROM employee 
WHERE ssn IN (
    SELECT employee FROM _order JOIN process USING (order_no)
    WHERE
        EXTRACT(YEAR FROM date)=2023 AND
        EXTRACT(MONTH FROM date)=1
)
AND ssn NOT IN(
    SELECT employee FROM office JOIN works USING(address)
);

*  postgresql://db:***@postgres/db
1 rows affected.

[('Catarina Alves',)]

3. Indique o nome do produto mais vendido;

In [11]:
%%sql

-- SELECT ...

WITH r AS (
    SELECT sku, (SUM(qty)) AS s
    FROM contains
    GROUP BY sku
),  
m AS (
    SELECT MAX(s) FROM r
)
SELECT 
    name FROM m JOIN r ON(max=s) JOIN product USING (sku);

*  postgresql://db:***@postgres/db
1 rows affected.

[('Luvas',)]

4. Indique o valor total de cada venda realizada.

In [9]:
%%sql

-- SELECT ...

SELECT 
    order_no, SUM(qty*price)
FROM 
    product JOIN contains USING(sku)
    JOIN _order USING(order_no)
WHERE
    payed='yes'
GROUP BY order_no
ORDER BY order_no ASC;

*  postgresql://db:***@postgres/db
9 rows affected.

[(1, Decimal('43.96')),
 (2, Decimal('57.22')),
 (4, Decimal('140.24')),
 (5, Decimal('90.87')),
 (8, Decimal('65.78')),
 (10, Decimal('157.30')),
 (11, Decimal('114.44')),
 (12, Decimal('338.85')),
 (13, Decimal('211.88'))]